

<?php               //ассоциативные массивы
	$arr = ['a'=>1, 'b'=>2, 'c'=>3];
	echo $arr['c'];
?>

<?php
	$arr1 = ['a'=>1, 'b'=>2, 'c'=>3];
	echo $arr1['a']+$arr1['b']+$arr1['c'];
?>

<?php
	$arr2 = ['Коля'=>'1000$', 'Вася'=>'500$', 'Петя'=>'200$'];
	echo $arr2['Петя'];
	echo $arr2['Коля'];
?>

<?php
	$arr3 = [1=> 'пн','вт','ср','чт','пт','сб','вс'];
	if (date(w)!=0) 
		echo $arr3[date(w)];
	else echo $arr3[7];
?>

<?php
	$arr4 = [1=> 'пн','вт','ср','чт','пт','сб','вс'];
		$day=4;
	echo $arr4[$day];
?>